read_verilog -sv rtl/pe.sv rtl/sa4x4.sv
hierarchy -top sa4x4
proc; opt; techmap
abc -fast
stat
tee -o synth/netlist/sa4x4_mapped.v write_verilog -noattr synth/netlist/sa4x4_mapped.v
